In [35]:
import pandas as pd
df1 = pd.read_csv('Bengaluru_House_Data.csv')
print(df1.head())

              area_type   availability        location       size  society  \
0  Super built-up  Area         19-Dec        Tilagorh      2 BHK  Coomee
1            Plot  Area  Ready To Move        Raajpara  4 Bedroom  Theanmp
2        Built-up  Area  Ready To Move       Kaalashil      3 BHK      NaN
3  Super built-up  Area  Ready To Move       Kalyanpur      3 BHK  Soiewre
4  Super built-up  Area  Ready To Move  Shaplabaag R/1      2 BHK      NaN

  total_sqft  bath  balcony   price
0       1056   2.0      1.0   39.07
1       2600   5.0      3.0  120.00
2       1440   2.0      3.0   62.00
3       1521   3.0      1.0   95.00
4       1200   2.0      1.0   51.00

In [36]:
df1.shape

(13320, 9)

In [3]:
df1.columns

Index(['Area_type', 'Availability', 'Location', 'size', 'society',
       'total_sqft', 'bath', 'balcony', 'price'],
      dtype='object')

In [6]:
df1['area_type'].unique()

array(['Super built-up  Area', 'Plot  Area', 'Built-up  Area',
       'Carpet  Area'], dtype=object)

In [7]:

df1['area_type'].value_counts()

Super built-up  Area    8790
Built-up  Area          2418
Plot  Area              2025
Carpet  Area              87
Name: Area_type, dtype: int64

In [9]:
df2 = df1.drop(['area_type','society','balcony','availability'],axis='columns')
df2.shape

(13320, 5)

In [10]:
df2.isnull().sum()

Location       1
size          16
total_sqft     0
bath          73
price          0
dtype: int64

In [11]:
df2.shape

(13320, 5)

In [12]:
df3 = df2.dropna()
df3.isnull().sum()

Location      0
size          0
total_sqft    0
bath          0
price         0
dtype: int64

In [13]:
df3.shape

(13246, 5)

In [14]:
df3['bhk'] = df3['size'].apply(lambda x: int(x.split(' ')[0]))
df3.bhk.unique()

C:\Users\ASUS\AppData\Roaming\Python\Python37\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

array([ 2,  4,  3,  6,  1,  8,  7,  5, 11,  9, 27, 10, 19, 16, 43, 14, 12,
       13, 18], dtype=int64)

In [15]:
def is_float(x):
    try:
        float(x)
    except:
        return False
    return True

In [16]:
2+3

5

In [17]:
df3[~df3['total_sqft'].apply(is_float)].head(10)

          Location       size      total_sqft  bath    price  bhk
30      Hatim Baag      4 BHK     2100 - 2850   4.0  186.000    4
122      Baag Bari      4 BHK     3067 - 8156   4.0  477.000    4
137   Jerjeri Para      2 BHK     1042 - 1105   2.0   54.005    2
165      Kalyanpur      2 BHK     1145 - 1340   2.0   43.490    2
188   Lalbagh Road      2 BHK     1015 - 1540   2.0   56.800    2
410     Dorji Para      1 BHK  34.46Sq. Meter   1.0   18.500    1
549    Hennur Road      2 BHK     1195 - 1440   2.0   63.770    2
648        Arekere  9 Bedroom       4125Perch   9.0  265.000    9
661      Yelahanka      2 BHK     1120 - 1145   2.0   48.130    2
672   Bettahalsoor  4 Bedroom     3090 - 5002   4.0  445.000    4

In [18]:

def convert_sqft_to_num(x):
    tokens = x.split('-')
    if len(tokens) == 2:
        return (float(tokens[0])+float(tokens[1]))/2
    try:
        return float(x)
    except:
        return None

In [19]:

df4 = df3.copy()
df4.total_sqft = df4.total_sqft.apply(convert_sqft_to_num)
df4 = df4[df4.total_sqft.notnull()]
df4.head(2)

   Location       size  total_sqft  bath   price  bhk
0  Tilagorh      2 BHK      1056.0   2.0   39.07    2
1  Raajpara  4 Bedroom      2600.0   5.0  120.00    4

In [20]:

df4.loc[30]

Location       Hatim Baag
size                4 BHK
total_sqft           2475
bath                    4
price                 186
bhk                     4
Name: 30, dtype: object

In [21]:
(2100+2850)/2

2475.0

In [22]:
df5 = df4.copy()
df5['price_per_sqft'] = df5['price']*100000/df5['total_sqft']
df5.head()

         Location       size  total_sqft  bath   price  bhk  price_per_sqft
0        Tilagorh      2 BHK      1056.0   2.0   39.07    2     3699.810606
1        Raajpara  4 Bedroom      2600.0   5.0  120.00    4     4615.384615
2       Kaalashil      3 BHK      1440.0   2.0   62.00    3     4305.555556
3       Kalyanpur      3 BHK      1521.0   3.0   95.00    3     6245.890861
4  Shaplabaag R/1      2 BHK      1200.0   2.0   51.00    2     4250.000000

In [23]:

df5_stats = df5['price_per_sqft'].describe()
df5_stats

count    1.320000e+04
mean     7.920759e+03
std      1.067272e+05
min      2.678298e+02
25%      4.267701e+03
50%      5.438331e+03
75%      7.317073e+03
max      1.200000e+07
Name: price_per_sqft, dtype: float64

In [24]:
df5.to_csv("bhp.csv",index=False)

In [34]:
df5.location = df5.location.apply(lambda x: x.strip())
location_stats = df5['location'].value_counts(ascending=False)
location_stats

AttributeError: 'DataFrame' object has no attribute 'location'

In [31]:
location_stats.values.sum()

13200

In [32]:
len(location_stats[location_stats>10])

238

In [33]:
len(location_stats)

1406